import { Chapter } from "@/types/reader";

export const CHAPTER_3_FA: Chapter = {
  id: "ch-3",
  title: "فصل ۳: تحلیل خودکار واریانت‌ها (Automated Variant Analysis)",
  readingTimeMinutes: 64,
  content: `## فصل ۳: تحلیل خودکار واریانت‌ها (Automated Variant Analysis)

> *«فقط ارتباط برقرار کن!»*
> — ئی. ام. فورستر، *هاواردز اند*

اکنون که تحلیل کد را هم از درون به بیرون و هم از بیرون به درون تجربه کرده‌اید، وقت آن رسیده که این دو را به هم متصل کنید. هنگامی که درگیر جزئیات ریز و درشت تحلیل جریان داده (Taint Analysis) بودید، شاید از خود پرسیده باشید که آیا می‌توان این فرایند را خودکار کرد. پاسخی که به این سؤال خواهید رسید، همان پاسخی است که در پژوهش آسیب‌پذیری (Vulnerability Research) بارها با آن روبه‌رو خواهید شد: «بستگی دارد».

در این فصل، پیش از آنکه با دو ابزار محبوب تحلیل ایستای کد (Static Code Analysis) متن‌باز یعنی CodeQL و Semgrep تمرین کنید، نظریه پشت تحلیل خودکار کد را خواهید آموخت. سپس این ابزارها را برای تحلیل واریانت (Variant Analysis) به کار می‌گیرید؛ با شناسایی یک الگوی کد آسیب‌پذیر از دل یک آسیب‌پذیری منفرد، واریانت‌های تکرارشده آن را در سایر بخش‌های کد کشف می‌کنید. از افزونه CodeQL برای Visual Studio Code (VS Code) نیز برای بهبود گردش کارتان استفاده خواهید کرد. در نهایت، تحلیل واریانت چندمخزنی (Multi-Repository Variant Analysis) را در مقیاس چندین پروژه امتحان خواهید کرد.

### درخت نحو انتزاعی (Abstract Syntax Tree)

برای آنکه عملکردی بهتر از یک عملیات ساده یافتن و جایگزینی با عبارت باقاعده (Regex) داشته باشند، ابزارهای مدرن تحلیل ایستای کد باید جنبه‌هایی از کد را درک کنند؛ مثلاً تفاوت تابع و متغیر، ارث‌بری کلاس‌ها در زبان‌های شیءگرا و غیره. این درک معمولاً به شکل یک درخت نحو انتزاعی (Abstract Syntax Tree یا AST) بیان می‌شود؛ بازنمایی از ساختار نحوی یک برنامه. ASTها هدفی بسیار بنیادی‌تر از تحلیل کد دارند: کامپایلرها از AST به‌عنوان بازنمایی میانی کد منبع استفاده می‌کنند تا پیش از کامپایل به کد ماشین، به‌سرعت بهینه‌سازی‌ها و بررسی‌های نحوی را انجام دهند.

می‌توانید یک AST را با ماژول داخلی ast پایتون visualize کنید. برای امتحان کردن آن، کد زیر را در اسکریپتی به نام ast_example_1.py ذخیره کنید:

\`\`\`python
import ast
# Python source code to convert to AST
code = """
name = 'World'
print('Hello,' + name)
"""
tree = ast.parse(code)
print(ast.dump(tree, indent=4))
\`\`\`

اسکریپت را اجرا کنید تا کد منبع به AST تبدیل شود. باید خروجی زیر را بگیرید:

\`\`\`text
$ python ast_example_1.py
Module(
    body=[
        Assign(
            targets=[
                Name(id='name', ctx=Store())],
            value=Constant(value='World')),
        Expr(
            value=Call(
                func=Name(id='print', ctx=Load()),
                args=[
                    BinOp(
                        left=Constant(value='Hello,'),
                        op=Add(),
                        right=Name(id='name', ctx=Load()))],
                keywords=[]))],
    type_ignores=[])
\`\`\`

خروجی در ساختاری درختی سازمان‌دهی شده است؛ Module گره ریشه (Root Node) است و به گره‌های فرزندی مانند Assign، Expr و Call شاخه می‌زند.

اکنون فرض کنید print یک تابع چاهک (Sink) خطرناک باشد. می‌خواهید بدانید آیا اجرای کد پایتون زیر باعث فراخوانی print می‌شود یا خیر:

\`\`\`python
def old_greet(name):
❶    print('Hello, ' + name)
yell = print
❷yell('HELLO, WORLD')
\`\`\`

این کد یک تابع ساده تعریف می‌کند که رشته 'Hello, ' را به‌همراه آرگومانش چاپ می‌کند. سپس کد، تابع داخلی print را به متغیر yell نسبت می‌دهد و آن را با آرگومان 'HELLO, WORLD' فراخوانی می‌کند.

رویکرد ساده‌انگارانه آن است که از یک Regex مانند /print\\([^)]*\\)/g استفاده کنید؛ اما نتیجه، یک مثبت کاذب (False Positive) ❶ و یک منفی کاذب (False Negative) ❷ خواهد بود. اگرچه تابع old_greet تابع print را فراخوانی می‌کند، هرگز مستقیماً در اسکریپت از آن استفاده نمی‌شود. در مقابل، yell چنین می‌کند، اما به دلیل یک انتساب مجدد ساده، الگوی Regex آن را از دست می‌دهد. نوشتن Regex‌ای که بتواند همه حالت‌های خاص (Edge Case) را مدیریت کند — حتی برای کدی به سادگی همین مثال — فوق‌العاده پیچیده و ردیابی‌ناپذیر خواهد بود.

راه‌حل بهتر این است که AST را پیمایش کنید و همه گره‌های Call را که با توجه به معنای گره‌های والدشان واقعاً رخ خواهند داد، شناسایی کنید. باز هم از ماژول ast برای تبدیل کد به AST استفاده کنید. کد نمونه را در فایل sample_code.py ذخیره و سپس اسکریپتی به نام ast_example_2.py با محتوای زیر در همان دایرکتوری بسازید:

\`\`\`python
import ast
import os
cur_dir = os.path.dirname(os.path.abspath(__file__))
with open(os.path.join(cur_dir, 'sample_code.py')) as f:
    tree = ast.parse(f.read())
print(ast.dump(tree, indent=4))
\`\`\`

خروجی اسکریپت باید چیزی شبیه زیر باشد:

\`\`\`text
$ python ast_example_2.py
Module(
    body=[
        FunctionDef(
            name='old_greet',
            args=arguments(
                posonlyargs=[],
                args=[
                    arg(arg='name')],
                kwonlyargs=[],
                kw_defaults=[],
                defaults=[]),
            Expr(
                value=Call(
                    func=Name(id='print', ctx=Load()),
                    args=[
                        BinOp(
                            left=Constant(value='Hello, '),
                            op=Add(),
                            right=Name(id='name', ctx=Load()))],
                    keywords=[]))],
            decorator_list=[]),
        Assign(
            targets=[
                Name(id='yell', ctx=Store())],
            value=Name(id='print', ctx=Load())),
        Expr(
            value=Call(
                func=Name(id='yell', ctx=Load()),
                args=[
                    Constant(value='HELLO, WORLD')],
                keywords=[]))],
    type_ignores=[])
\`\`\`

اکنون که می‌دانید هر گره چه کاری انجام می‌دهد، می‌توانید AST را به‌شکل کارآمدی پیمایش کنید: فقط از گره‌هایی مانند Assign و Expr به پایین بروید و از FunctionDef و گره‌های مشابه صرف‌نظر کنید، مگر آنکه تابع تعریف‌شده در جایی از برنامه فراخوانی شود. با ردیابی متغیرهای تحت تأثیر Assign، در نهایت به‌درستی تشخیص خواهید داد که مسیرِ پیمایش‌شده در درخت به گره Call‌ای می‌رسد که مقدار ویژگی func آن در واقع print است.

همین ساختار درختی به الگوریتم‌های بهینه مختلفی اجازه می‌دهد برای اطلاعات مورد نیاز شما از AST کوئری بگیرند و از هدر رفتن توان محاسباتی روی شاخه‌های حذف‌شده جلوگیری کنند. راه دیگر برای بازنمایی کد، نمودار جریان کنترل (Control Flow Graph یا CFG) است که مسیرهای احتمالی عبور از برنامه در حین اجرا را مدل می‌کند. این ساختار امکان کوئری‌های پیشرفته‌تر و هدفمندتری روی کد را می‌دهد؛ مانند تحلیل دسترس‌پذیری (Reachability Analysis) که تعیین می‌کند کدام بخش‌های کد واقعاً در حین اجرا قابل دسترسی‌اند.

نوع دیگر بازنمایی، نمودار جریان داده (Data Flow Graph یا DFG) است. در حالی که CFGها به ترتیب اجرا در برنامه می‌پردازند (مانند دستورات if-else و حلقه‌ها)، DFGها بر انتشار و تبدیل داده تمرکز دارند (شامل متغیرها و عبارات). هر دوی CFG و DFG بازنمایی‌های مفیدی از کد برای تحلیل خودکار هستند.

همین اندازه از نظریه برای فهم چگونگی کارکرد ابزارهای تحلیل ایستای کد اهمیت دارد. هر انتزاعی به‌ناچار بخشی از جزئیات را از دست می‌دهد. اگرچه تحلیل دستی کد از این نظر جامع‌تر است، اما بازبینی دستی کدِ نرم‌افزارهای پیچیده که ممکن است میلیون‌ها خط کد داشته باشند، اغلب عملی نیست. ابزارهای تحلیل ایستای کد در چنین مواردی فوق‌العاده مفیدند و شناخت نقاط قوت و ضعفشان به شما امکان می‌دهد آن‌ها را مؤثرتر در پشتیبانی از استراتژی تحلیل کدتان به کار بگیرید.

### ابزارهای تحلیل ایستای کد (Static Code Analysis Tools)

همه ابزارهای تحلیل کد منبع یکسان ساخته نشده‌اند. تفاوت‌ها در انتزاع‌ها و روش‌های کوئری‌گیری بر میزان اثربخشی یک ابزار در جستجوی الگوهای خاص در کد اثر می‌گذارد. در این بخش، این تفاوت‌ها را در عمل با CodeQL و Semgrep مشاهده خواهید کرد.

#### CodeQL

CodeQL یک موتور تحلیل کد با ریشه‌های عمیق در دانشگاه است. این ابزار توسط تیمی پژوهشی در دانشگاه آکسفورد ساخته شد که یک زبان کوئری شیءگرا (در اصل با نام .QL) توسعه داد که می‌توانست روی یک دیتابیس رابطه‌ای شامل مدلِ کد، کوئری اجرا کند. همین تمرکز بر دیتابیس یکی از تفاوت‌های کلیدی CodeQL و Semgrep است: CodeQL پیش از اجرای هر کوئری باید یک دیتابیس از کد بسازد. برای زبان‌های کامپایلی، این فرایند با سیستم بیلد زبان برنامه‌نویسی — مانند make برای C و ++C — یکپارچه شده است. برای زبان‌های غیرکامپایلی مانند پایتون، CodeQL از Extractorها برای پردازش کد پیش از ذخیره در دیتابیس استفاده می‌کند.

تعجب‌آور نیست که زبان کوئری CodeQL شباهت بسیاری به زبان‌های کوئری دیتابیس مانند SQL دارد. برای مثال، این کوئری CodeQL را ببینید که فراخوانی‌های print را پیدا می‌کند:

\`\`\`sql
import python
from Call call, Name name
where call.getFunc() = name and name.getId() = "print"
select call, "call to 'print'."
\`\`\`

کلاس‌های CodeQL (یعنی Call و Name) همنام انواع ماژول ast پایتون هستند، زیرا Extractor پایتونِ CodeQL هم از ast و هم از کلاس گسترش‌یافته semmle.python.ast خودش برای پردازش کدبیس‌های پایتون استفاده می‌کند. به همین ترتیب، بسیاری از Extractorهای دیگر آن به ژرفای بافت (Context) زبان برنامه‌نویسی هدف نفوذ می‌کنند. برای مثال، Extractor زبان Go در CodeQL نیز از پکیج go/ast کتابخانه استاندارد Go استفاده می‌کند (https://github.com/github/codeql/blob/820de5d/go/extractor/extractor.go). رویکرد بسیار سفارشی‌شده استخراج در هر زبان به CodeQL امکان می‌دهد دیتابیس‌های جامعی از روابط جریان داده و جریان کنترل بسازد.

با رویکرد ژرف CodeQL می‌توانید کوئری‌های قدرتمند ردیابی آلودگی سراسری (Global Taint Tracking) بسازید تا آسیب‌پذیری‌های منبع-به-چاهک (Source-to-Sink) را بیابید. علاوه بر این، زبان کوئری شیءگرای CodeQL اجازه می‌دهد مؤلفه‌ها را به‌سادگی بازاستفاده کنید. مثال بعدی نقاط قوت CodeQL را نشان می‌دهد.

##### مثال ردیابی آلودگی چندفایلی (Multifile Taint Tracking Example)

یک وب‌API سرور Node.js ساخته‌شده با فریمورک Express را در نظر بگیرید که از دو فایل index.js و utils.js تشکیل شده است. این وب‌API یک Endpoint منفرد به نام /ping دارد که باعث می‌شود سرور به هر آدرس IP موجود در پارامتر کوئری ip پینگ بفرستد.

متأسفانه توسعه‌دهنده ناخواسته یک قابلیت «اجراهای کد راه‌دور به‌عنوان سرویس» از طریق یک آسیب‌پذیری تزریق دستور (Command Injection) وارد کرده است:

\`\`\`javascript
index.js
const express = require("express");
❶const { ping } = require("./utils.js");
const app = express();
app.get("/ping", (req, res) => {
❷    const ip = req.query.ip;
    res.send(\`Result: \\n\${ping(ip)}\`);
})
app.listen(3000);
\`\`\`

نمی‌توانید فقط با تحلیل کد index.js تشخیص دهید که آیا این آسیب‌پذیری وجود دارد یا خیر. هرچند این فایل یک منبع داده تحت کنترل کاربر به شکل req.query.ip ❷ اضافه می‌کند، باید بررسی کنید که آیا تابع ping که از utils.js ❶ ایمپورت شده، آرگومان ip را به یک چاهک خطرناک می‌فرستد یا خیر:

\`\`\`javascript
utils.js
const { execSync } = require("child_process");
exports.ping = (ip) => {
    try {
❶        return execSync(\`ping -c 5 \${ip}\`);
    } catch (error) {
        return error.message;
    }
};
\`\`\`

متأسفانه، ping مقدار ip را به تابع execSync ❶ می‌فرستد؛ تابعی که با اولین آرگومان خود یک دستور شل (Shell) اجرا می‌کند. مهاجم می‌تواند هر دستوری را با فرستادن یک پارامتر کوئری ip مانند ;whoami اجرا کند. اگرچه این یک کار ساده بازبینی کد است، فرایند ردیابی منبع-به-چاهک بیشتر جستجوهای مبتنی بر Regex را مات و مبهوت می‌کند، چون این جستجوها به‌سادگی نمی‌توانند توابع ایمپورت‌شده و جریان داده را میان فایل‌ها به هم مرتبط کنند. خوشبختانه CodeQL می‌تواند، چون کد را به‌شکل یک DFG مدل می‌کند و آن را با ردیابی آلودگی گسترش می‌دهد. در حالی که تحلیل جریان داده، انتشار داده (مانند یک متغیر) را دنبال می‌کند، متغیرهای آلوده‌شده دیگر را ردیابی نمی‌کند. دو کتابخانه جداگانه DataFlow و TaintTracking که CodeQL فراهم می‌کند بازتاب همین موضوع است.

علاوه بر این، CodeQL کلاس‌های مناسبی برای منبع‌ها و چاهک‌های رایج فراهم می‌کند؛ از جمله ورودی کاربر راه‌دور و توابع اجرای دستور. بنابراین یک قانون ساده ردیابی آلودگی سراسری برای سرور آسیب‌پذیر قبلی را می‌توان چنین نوشت:

\`\`\`sql
/**
 * @id remote-command-injection
 * @name Remote Command Injection
 * @kind path-problem
 * @severity error
 */
import javascript
module RemoteCommandInjectionConfig implements DataFlow::ConfigSig {
    predicate isSource(DataFlow::Node source) {
❶        source instanceof RemoteFlowSource
    }
    predicate isSink(DataFlow::Node sink) {
❷        sink = any(SystemCommandExecution sys).getACommandArgument()
    }
}
module RemoteCommandInjectionFlow =
    TaintTracking::Global<RemoteCommandInjectionConfig>;
import RemoteCommandInjectionFlow::PathGraph
from RemoteCommandInjectionFlow::PathNode source,
    RemoteCommandInjectionFlow::PathNode sink
where RemoteCommandInjectionFlow::flowPath(source, sink)
select sink.getNode(), source, sink,
    "taint from $@ to $@.", source.getNode(), "source", sink, "sink"
\`\`\`

فعلاً لازم نیست نگران جزئیات دقیق سینتکس CodeQL باشید. در عوض بر ساختار کلی کوئری تمرکز کنید؛ مثلاً پیکربندی ردیابی آلودگی که منبع‌ها را نمونه‌هایی از RemoteFlowSource ❶ و چاهک‌ها را آرگومان دستور در هر نمونه SystemCommandExecution ❷ تعریف می‌کند. همین اندازه برای ردیابی جریان داده قابل‌کنترل-توسط-مهاجم به یک فراخوانی تابع آسیب‌پذیر کافی است (فصل ۱ را ببینید). خودِ کوئری بررسی می‌کند که آیا مسیر جریانی از منبع‌ها به چاهک‌ها وجود دارد یا خیر، و در صورت وجود، نتایج را در ساختاری خروجی می‌دهد که CodeQL می‌تواند آن را به مسیرهای گام‌به‌گام جامع تبدیل کند (برای اختصار، برخی از گام‌های میانی را حذف کرده‌ام):

\`\`\`text
"results" : [ {
    --snip--
    "codeFlows" : [ {
        "threadFlows" : [ {
            "locations" : [ {
                "location" : {
                    "physicalLocation" : {
                        "artifactLocation" : {
                            "uri" : "index.js",
                            "uriBaseId" : "%SRCROOT%",
                        },
                        "region" : {
                            "startLine" : 7,
                            "startColumn" : 16,
                            "endColumn" : 28
                        }
                    },
                    "message" : {
❶                        "text" : "req.query.ip"
                    }
                }
            },
            --snip--
            {
                "location" : {
                    "physicalLocation" : {
                        "artifactLocation" : {
                            "uri" : "index.js",
                            "uriBaseId" : "%SRCROOT%",
                            "index" : 1
                        },
                        "region" : {
                            "startLine" : 8,
                            "startColumn" : 32,
                            "endColumn" : 34
                        }
                    },
                    "message" : {
❷                        "text" : "ip"
                    }
                }
            },
            --snip--
            {
                "location" : {
                    "physicalLocation" : {
                        "artifactLocation" : {
                            "uri" : "utils.js",
                            "uriBaseId" : "%SRCROOT%",
                            "index" : 0
                        },
                        "region" : {
                            "startLine" : 5,
                            "startColumn" : 21,
                            "endColumn" : 38
                        }
                    },
                    "message" : {
❸                        "text" : "\`ping -c 5 \${ip}\`"
                    }
                }
            } ]
        } ]
    } ]
\`\`\`

CodeQL داده آلوده را با دقت از مقدار پارامتر کوئری درخواست req.query.ip ❶ به متغیر ip ❷ و سرانجام به رشته قالبی (Template String) که در utils.js به execSync پاس داده شده ❸ ردیابی می‌کند. اگر قرار بود تحلیل جریان داده سراسری را با جایگزینی TaintTracking::Configuration با DataFlow::Configuration اجرا کنید، نتیجه‌ای نمی‌گرفتید، زیرا تحلیل جریان داده فقط مقدارِ حفظ‌شده داده req.query.ip را دنبال می‌کند. استفاده از رشته قالبی در آرگومان پاس‌داده‌شده به execSync یعنی دیگر مقدار req.query.ip حفظ نشده و مسیر جریان داده در همین‌جا قطع می‌شود. اگر utils.js به‌جای آن از execSync(ip) استفاده می‌کرد، تحلیل جریان داده نیز کار می‌کرد.

قدرت ردیابی آلودگی سراسری با مبادلات (Trade-off) جدی همراه است: حرکت از تحلیل محلی به سراسری، و از جریان داده به ردیابی آلودگی، از نظر محاسباتی پرهزینه‌تر و کم‌دقت‌تر است. علاوه بر این، سینتکس قوانین CodeQL نسبتاً پیچیده است. قوانین CodeQL با زبانی به نام QL نوشته می‌شوند؛ یک زبان برنامه‌نویسی شیءگرا برای نوشتن کوئری. به همین دلیل است که بخش اول RemoteCommandInjection.ql شبیه کد شیءگرای معمول با کلاس‌ها و بازنویسی متدها (Override) است، در حالی که کوئری پایانی در انتهای فایل شبیه یک زبان کوئری دیتابیس با بندهای from، where و select است.

برای استفاده مؤثر از CodeQL، عملاً باید یک زبان برنامه‌نویسی جدید یاد بگیرید و با کتابخانه‌های استاندارد CodeQL آشنا شوید. ممکن است این تلاش ارزشمند باشد، زیرا ماهیت کوئری‌محور QL به شما امکان می‌دهد روابط و محمول‌های (Predicate) پیچیده‌ای را برای کوئری‌های قدرتمند ردیابی آلودگی سراسری بیان کنید.

توسعه‌دهندگان CodeQL کلاس‌های کمکی بسیاری برای فریمورک‌های رایج مانند Express، Spring و Ruby on Rails افزوده‌اند. برای مثال، به‌جای RemoteFlowSource در کوئری نمونه، می‌توانید از Express::RequestSource استفاده کنید تا به‌طور خاص ورودی‌های درخواست وبِ فریمورک Express را ردیابی کنید.

از طرف دیگر، با جابه‌جایی مداوم میان تحلیل کد هدف و نوشتن کوئری مورد نظر، جابه‌جایی بافتی (Context Switching) زیادی را تجربه خواهید کرد.

##### افزونه VS Code (VS Code Extension)

برای کاهش اصطکاک توسعه کوئری‌های CodeQL، می‌توانید از افزونه CodeQL برای Visual Studio Code استفاده کنید. این افزونه تعدادی عنصر رابط کاربری و قابلیت به ویرایشگر VS Code اضافه می‌کند که با CodeQL CLI کار می‌کنند تا یک محیط توسعه یکپارچه (IDE) برای نوشتن کوئری‌های QL فراهم شود.

هرچند افزونه همراه با CodeQL CLI اختصاصی خودش عرضه می‌شود، مستندات آن چنین می‌گوید:

> CLI مدیریت‌شده توسط افزونه از ترمینال در دسترس نیست. اگر قصد دارید از CLI خارج از افزونه استفاده کنید (مثلاً برای ساخت دیتابیس)، توصیه می‌کنیم نسخه خودتان از CodeQL CLI را نصب کنید.

از آنجا که قرار است دیتابیس‌های CodeQL خودتان را به‌صورت محلی بسازید، ابتدا باید CodeQL CLI را نصب کنید. آخرین نسخه را از https://github.com/github/codeql-action/releases دانلود، آرشیو را استخراج و آن را به PATH اضافه کنید. برای مثال در Kali Linux دستورات زیر را اجرا کنید:

\`\`\`bash
$ wget https://github.com/github/codeql-action/releases/download/codeql-bundle-v2.20.2/codeql-bundle-linux64.tar.gz
$ tar -xzvf codeql-bundle-linux64.tar.gz
$ echo "export PATH=\\$PATH:$(pwd)/codeql" >> ~/.zshrc
$ source ~/.zshrc
$ codeql version
--snip--
Unpacked in: /home/kali/Desktop/codeql
Analysis results depend critically on separately distributed query and
extractor modules. To list modules that are visible to the toolchain,
use 'codeql resolve packs' and 'codeql resolve languages'.
\`\`\`

پس از نصب CodeQL CLI، نرم‌افزار VS Code را از https://code.visualstudio.com/download دانلود کنید (برای Kali Linux پکیج .deb را دانلود کنید) و با دستور sudo apt install <مسیر دانلود> نصبش کنید.

سپس VS Code را باز کنید و افزونه CodeQL را با میان‌بر CTRL-P و وارد کردن عبارت ext install GitHub.vscode-codeql نصب کنید. به‌علاوه می‌توانید روی دکمه Extensions در نوار Activity سمت چپ کلیک کنید، افزونه CodeQL را در Marketplace جستجو و نصب کنید.

پس از نصب افزونه، فضای کاری CodeQL starter را از https://github.com/github/vscode-codeql-starter در دایرکتوری کاری دلخواه شما Git clone کنید. حتماً زیرماژول‌های Git را به‌صورت بازگشتی (Recursive) کلون کنید:

\`\`\`bash
git clone --recursive https://github.com/github/vscode-codeql-starter
\`\`\`

وگرنه بعداً می‌بینید که کتابخانه‌های مهم CodeQL را از دست داده‌اید.

در نهایت، فایل فضای کاری vscode-codeql-starter.code-workspace را در VS Code از طریق File ▶ Open Workspace باز کنید.

با این کار محیط توسعه CodeQL شما آماده می‌شود؛ محلی که کوئری‌های CodeQL را در آن می‌نویسید و تست می‌کنید. اما پیش از اجرای کوئری‌ها، باید یک دیتابیس CodeQL که از کد منبعِ هدف تولید شده را مشخص کنید تا کوئری‌ها روی آن اجرا شوند. اگرچه افزونه اجازه می‌دهد دیتابیس‌های CodeQL ساخته‌شده توسط دیگران را از منابع راه‌دوری مانند GitHub دانلود کنید، شما خودتان با استفاده از مثال ردیابی آلودگی چندفایلیِ بخش قبلی، یک دیتابیس خواهید ساخت.

یک دایرکتوری پروژه خارج از فضای کاری CodeQL starter بسازید. فایل‌های نمونه index.js و utils.js را به آن منتقل کنید. اگر از مخزن کد نمونه کتاب استفاده می‌کنید، این دایرکتوری در مسیر chapter-03/command-injection-example/app قرار دارد.

به دایرکتوری والدِ دایرکتوری پروژه بروید و با دستورات زیر دیتابیس CodeQL را بسازید:

\`\`\`bash
$ cd chapter-03/command-injection-example
$ codeql database create --language javascript --source-root app example-database
--snip--
Finished writing database (relations: 13.30 MiB; string pool: 4.78 MiB).
TRAP import complete (2.1s).
Finished zipping source archive (243.70 KiB).
Successfully created database at /home/kali/Desktop/from-day-zero-to-zero-day/chapter-03/command-injection-example/example-database.
\`\`\`

حالا که دیتابیس CodeQL را با موفقیت از کد نمونه تولید کردید، می‌توانید کوئری نمونه تزریق دستور راه‌دور CodeQL را روی آن بیازمایید:

1. در فضای کاری VS Code، روی دکمه CodeQL در نوار Activity سمت چپ کلیک کنید تا یک نوار کناری CodeQL با چند نما باز شود، از جمله Databases، Variant Analysis Repositories، Query History و AST Viewer.
2. در نمای Databases، روی دکمه افزودن دیتابیس CodeQL از **From a folder** کلیک کنید و دایرکتوری example-database که قبلاً ساختید را باز کنید.
3. پس از بارگذاری دیتابیس، روی example-database در نمای Databases در نوار کناری CodeQL راست‌کلیک و گزینه Add Database Source to Workspace را انتخاب کنید.
4. با کلیک روی آیکون فایل‌ها در نوار Activity به نمای Explorer بروید. باید پوشه جدیدی در نوار کناری فایل‌ها ببینید: example-database source archive که فایل‌های کد منبع اصلی را شامل می‌شود.
5. روی index.js در پوشه جدید راست‌کلیک و CodeQL: View AST را انتخاب کنید تا نمای AST Viewer در نوار کناری افزونه CodeQL باز شود و نشان دهد دیتابیس CodeQL چگونه کد را بازنمایی می‌کند.
6. روی هر آیتم در نمای AST Viewer کلیک کنید تا فایل کد منبع متناظر یعنی index.js باز شده و کد مربوطه هایلایت شود. همچنین می‌توانید کدی را در فایل انتخاب کنید تا به‌طور خودکار گره متناظر در دیتابیس باز شود. مثلاً اگر \`res.send(\\\`Result: \\n\${ping(ip)}\\\`);\` را انتخاب کنید، AST Viewer به شما می‌گوید این یک گره ExprStmt با گره فرزند MethodCallExpr است. این موضوع به شما کمک می‌کند هنگام نوشتن کوئری، کلاس‌های صحیح را انتخاب کنید.
7. به نمای Explorer برگردید و فایل کوئری RemoteCommandInjection.ql را (یا آن را از مخزن کد کتاب کپی کنید) در دایرکتوری codeql-custom-queries-javascript بسازید. نمی‌توانید فایل کوئری را تنها ایجاد کنید، زیرا کوئری‌های QL به فایل qlpack.yml در همان دایرکتوری ارجاع می‌دهند تا مشخص شود کدام وابستگی‌های کتابخانه CodeQL باید شامل شوند. در این مورد، به کتابخانه codeql/javascript-all نیاز دارد.
8. روی فایل کوئری راست‌کلیک و CodeQL: Run Queries in Selected Files را انتخاب کنید.

افزونه باعث می‌شود CodeQL CLI کوئری شما را روی دیتابیس اجرا کند و نتایج را پردازش کند. اگر همه‌چیز درست کار کند، باید یک نمای نتایجِ قالب‌بندی‌شده در ناحیه ویرایشگر سمت راست ببینید.

اگر یک ردیف از نتایج را باز کنید، فهرستی از هر گام آلودگی (Taint Step) از منبع تا چاهک می‌گیرید. کلیک روی هر گام شما را مستقیماً به محل دقیق کد منبعِ متناظر با آن گام می‌برد که برای تحلیل نتایج کوئری و دیباگ کوئری‌های پیش‌نویس بسیار کمک‌کننده است.

از آنجا که بعداً — هنگام بحث تحلیل واریانت چندمخزنی — دوباره از CodeQL استفاده خواهید کرد، این راه‌اندازی را آماده نگه دارید. اما پیش از آن، از Semgrep برای تحلیل واریانت تک‌مخزنی استفاده خواهید کرد.

#### Semgrep

Semgrep ابزار محبوب دیگری برای تحلیل کد است که برخلاف سینتکس کوئری‌محور CodeQL، از سینتکس قواعد الگو‌محور (Pattern-Oriented) استفاده می‌کند. این موضوع بر قابلیت استفاده و توانمندی‌های Semgrep اثر می‌گذارد و به نوبه خود بر موارد استفاده‌ای اثر می‌گذارد که Semgrep برای آن‌ها بهتر از CodeQL عمل می‌کند.

> توجه: برای آشنایی بیشتر با خاستگاه جذاب Semgrep، پست وبلاگ «Semgrep: A Static Analysis Journey» نوشته Yoann Padioleau (نویسنده پیش‌درآمد Semgrep یعنی sgrep) را در https://semgrep.dev/blog/2021/semgrep-a-static-analysis-journey/ بخوانید.

قانون زیر (express-injection.yml) را در نظر بگیرید که همان آسیب‌پذیری تزریق دستورِ کوئری CodeQL یعنی RemoteCommandInjection.ql را شناسایی می‌کند:

\`\`\`yaml
rules:
  - id: express-injection
    mode: taint ❶
    pattern-sources:
      - pattern: req.query.$PARAMETER ❷
    pattern-sinks:
      - pattern: execSync(...) ❸
    message: Passing user-controlled Express query parameter to a command injection.
    languages:
      - javascript
    severity: ERROR
    metadata:
      interfile: true
\`\`\`

اگرچه برای مقاصد این فصل لازم نیست زیاد در جزئیات سینتکس قواعد Semgrep عمق پیدا کنید، چند مؤلفه کلیدی هست که باید بشناسید. نخست آنکه قاعده با فرمت YAML نوشته می‌شود؛ زبانی برای سریال‌سازی داده که در فایل‌های پیکربندی رایج است. پس مراقب ظرافت‌های مخصوص YAML باشید، مانند رشته‌های چندخطی (با پیشوند |)، مقدارهای Boolean و کاراکترهای Escape.

سپس، غیر از حالت تطبیق الگوی استاندارد، Semgrep از حالت‌های taint، join و extract نیز پشتیبانی می‌کند. این‌ها برای ساختن قوانین قدرتمندتر — که با مواجهه با الگوهای پیچیده‌تر کد به آن‌ها نیاز خواهید داشت — مفیدند. در بقیه این کتاب، فقط از حالت‌های معمولی و taint استفاده خواهید کرد.

بیشترین استفاده میان قابلیت‌های الگو به متغیرهای فرا (Metavariable) تعلق می‌گیرد که نامشان همیشه با کاراکتر دلار ($) پیش می‌رود و فقط می‌تواند شامل حروف بزرگ، زیرخط (_) یا ارقام باشد ❷. از متغیرهای فرا برای تطبیق آیتمی استفاده می‌کنید — مانند نام متغیر یا تابع — که می‌تواند هر مقداری باشد نه یک مقدار ثابت. محتوای تطبیق‌یافته در متغیر فرا ذخیره می‌شود و به شما امکان می‌دهد بررسی‌های بیشتری روی آن‌ها انجام دهید؛ مثلاً اطمینان از اینکه متغیر فرا با الگوی خاصی مطابقت دارد.

بلافاصله بعد از آن، عملگر سه‌نقطه (Ellipsis) ❸ قرار دارد که با دنباله‌ای از صفر یا چند آیتم — مانند دستورات، کاراکترهای یک رشته یا آرگومان‌های تابع — تطبیق می‌یابد. این عملگر به شما امکان می‌دهد بخش‌هایی از کد را که به آن‌ها اهمیت نمی‌دهید اما هنوز می‌خواهید در تطبیق لحاظ شوند، به‌سرعت انتزاعی کنید.

> توجه: یک‌بار، هنگام تلاش برای نوشتن یک قاعده Semgrep برای تطبیق پیکربندی ناامنی در فایل XML که شبیه <setting name="sanitizeInputs">off</setting> بود، یکی از کاربران Semgrep مدام با پیام خطای False is not of type 'string' in pattern ['rules'][0]['pattern']() روبه‌رو می‌شد. پس از آنکه مدتی طولانی زیادی سردرگم شدیم، متوجه شدیم YAML نسخه 1.1 مقدارهای on و off را به‌جای رشته، Boolean تفسیر می‌کند!

اغلب از متغیرهای فرا و عملگرهای سه‌نقطه به‌طور هم‌زمان استفاده خواهید کرد. برای مثال، فرض کنید می‌خواهید رازهای هاردکدشده در کد را بیابید که به متغیرهایی با پیشوند SECRET_ نسبت داده شده‌اند؛ مانند زیر:

\`\`\`javascript
var SECRET_KEY = "D3ADB33F"
var SECRET_TOKEN = "1337"
\`\`\`

لازم نیست مقدارهای دقیق رشته‌ها را تطبیق دهید، چون می‌توانند هر مقداری باشند. این الگو کار را انجام می‌دهد:

\`\`\`yaml
patterns:
  - pattern: var $VARIABLE_NAME = "..."
  - metavariable-regex:
      metavariable: $VARIABLE_NAME
      regex: SECRET_.*
\`\`\`

نکته پایانی پیش از ادامه، نحوه ترکیب الگوهای Semgrep است. عملگر patterns روی الگوهای فرزند خود عملگر منطقی AND را اعمال می‌کند؛ در اینجا فقط کدی که هم با انتساب متغیر رشته‌ای مطابقت دارد و هم نام متغیرش با SECRET_.* شروع می‌شود، نتیجه محسوب می‌شود. برای انجام عملگر منطقی OR از pattern-either استفاده کنید. می‌توانید این عملگرها را چند بار تو در تو کنید، اما خیلی زود دست‌وپاگیر می‌شود.

همان‌طور که اشاره شد، یکی از حیاتی‌ترین تفاوت‌های سینتکسی میان قاعده Semgrep و کوئری CodeQL این است که سینتکس Semgrep الگو‌محور است، در حالی که سینتکس QL کوئری‌محور است. Semgrep بر تطبیق الگوهای خاص در کد تمرکز دارد و CodeQL به برنامه‌نویسیِ یک دیتابیس می‌پردازد. با توجه به لایه اضافی انتزاع و جابه‌جایی بافتیِ لازم برای مورد دوم، می‌توان استدلال کرد که سینتکس قواعد Semgrep آسان‌تر یاد گرفته می‌شود.

غیر از سینتکس الگو، Semgrep و CodeQL در نحوه بازنمایی کد منبع برای تحلیل جریان داده نیز متفاوت‌اند. Semgrep به‌جای استخراج داده رابطه‌ای و کلاس‌های مخصوص هر زبان و ذخیره‌شان در دیتابیس، کدِ زبان‌های مختلف را به یک AST عمومی پردازش می‌کند و سپس آن را به یک زبان میانی (IL) تبدیل می‌کند که تطبیق الگو روی آن اجرا می‌شود.


این رویکرد یعنی تحلیل جریان داده Semgrep تا حد زیادی مستقل از زبان (Language-Agnostic) است، برخلاف کوئری‌های زبان‌محور CodeQL. برای مثال، CodeQL نمی‌تواند در یک دیتابیس پایتون، نمونه‌ای از کلاس CallExpr جاوااسکریپت را کوئری کند، زیرا کتابخانه پایتون CodeQL فقط کلاس معادل یعنی Call را پشتیبانی می‌کند. در مقابل، Semgrep می‌تواند الگوی function_name(...) را هم در کدبیس‌های جاوااسکریپت و هم پایتون تطبیق دهد و حتی مرحله ساخت دیتابیس را نیز حذف می‌کند.

با این حال، رویکرد Semgrep به از دست رفتن داده‌های مهم تحلیل برنامه نیز می‌انجامد. ASTها برخلاف CFGها یا DFGها نمی‌توانند اجرا یا جریان داده را مستقیماً بازنمایی کنند که برای ردیابی آلودگی صحیح حیاتی است. علاوه بر این، قابلیت‌های زبان‌محور (مانند ارث‌بری کلاس و بازنویسی متدها که بر ردیابی آلودگی اثر می‌گذارند) در یک AST عمومی از دست می‌روند، و چون به ازای هر فایل یک AST ساخته می‌شود، تحلیل آلودگی بین‌فایلی ممکن نیست.

برای جبران شکاف‌های موتور پایه Semgrep OSS، توسعه‌دهندگان Semgrep موتور پولی Semgrep Pro را ساختند که از تحلیل بین‌فایلی و بین‌تابعی و پشتیبانی گسترده‌تر زبان‌ها برخوردار است. می‌توانید به این قابلیت‌ها از طریق Semgrep Playground (https://semgrep.dev/playground) دسترسی داشته باشید که امکان تست قواعد Semgrep روی کد را فراهم می‌کند.

در Semgrep Playground، به تب «advanced» بروید و قاعده express-injection.yml را از ابتدای این بخش بچسبانید. ویرایشگر کد تست در سمت راست فقط یک ورودی متنی می‌پذیرد، اما می‌توانید محتوای utils.js و index.js را پشت سر هم بچسبانید. مطمئن شوید کلید Pro در بالا-سمت راست روشن است. حالا روی Run کلیک کنید. باید همان‌طور که انتظار دارید، تطبیق الگوی هایلایت‌شده را در execSync(\`ping -c 5 \${ip}\`) ببینید.

اگرچه می‌توانید Semgrep Pro را در Playground بیازمایید، برای استفاده روی بیش از چند قطعه کد به اشتراک (Subscription) نیاز دارید. بنابراین در بخش بعدی، برای تحلیل کد از Semgrep OSS یعنی موتور پایه استفاده خواهید کرد، زیرا قرار است با چندین فایل در یک کدبیس بزرگ کار کنید. می‌توانید آن را با مدیر پکیج پایتون یعنی pip و با اجرای pip install semgrep نصب کنید.

همان‌طور که در مستندات اشاره شده، Semgrep OSS چند تحلیل فراهم می‌کند، مانند انتشار ثابت (Constant Propagation) و ردیابی آلودگی (https://semgrep.dev/docs/writing-rules/data-flow/data-flow-overview). همچنین فقط تحلیل درون‌رویه‌ای (Intraprocedural) انجام می‌دهد؛ یعنی جریان داده را درون یک تابع یا متد منفرد تحلیل می‌کند و با برخی مبادلات طراحی همراه است که سرعت را به بهای جامعیت بهتر می‌کند؛ مانند ردیابی آلودگی محدود برای داده‌هایی که از طریق اشاره‌گرها (Pointer) منتقل می‌شوند.

به دلیل انتخاب‌های بنیادی طراحی در سطح تحلیل برنامه (که در نهایت بر تجربه عملی نوشتن قوانین اثر می‌گذارند)، Semgrep OSS بسیار سریع‌تر از CodeQL و با سربار کمتری اجرا می‌شود. هنگام نوشتن قاعده لازم نیست نگران انتخاب کلاس یا نوع صحیح باشید. نیازی به ساخت دیتابیس یا کامپایل کوئری هم نیست و می‌توانید بسیار سریع‌تر تکرار (Iterate) کنید. یک مورد استفاده خاص، زمانی است که به دنبال الگویی نسبتاً ساده اما نادر در صدها یا حتی هزاران کدبیس می‌گردید؛ مثلاً وقتی من آسیب‌پذیری‌های بالقوه افزونه‌های مرورگر را در یک دیتابیس بزرگ از افزونه‌ها غربال می‌کردم (https://spaceraccoon.dev/universal-code-execution-browser-extensions/). پژوهش آسیب‌پذیری اغلب مستلزم تخصیص دقیق زمان و نیروی انسانی برای رسیدن به نتیجه با هزینه معقول است. شناخت اینکه کدام ابزار برای کدام هدف مناسب‌تر است، کلید ماجراست.

### تحلیل واریانت (Variant Analysis)

پژوهش آسیب‌پذیری به مرور زمان سخت‌تر شده است، زیرا توسعه‌دهندگان راهکارهای کاهش خطر در سطح سیستم (System-Level Mitigation) پیاده می‌کنند و کد امن‌تری می‌نویسند. آسیب‌پذیری‌های جدید به‌طور منظم کشف می‌شوند، اما خیلی دور از آن غرب وحشیِ گذشته است. در نتیجه، اکنون باید زمان و تخصص بسیار بیشتری برای کشف آسیب‌پذیری‌های اثرگذار در محبوب‌ترین نرم‌افزارها سرمایه‌گذاری کنید.

برای مثال، برنامه‌های متن‌باز بزرگ مانند LibreOffice به‌سادگی می‌توانند میلیون‌ها خط کد داشته باشند. ابزارهای خودکار تحلیل کد منبع می‌توانند زمان لازم برای تحلیل آن کد را کاهش دهند، اما همچنان باید همه نتایج را دسته‌بندی (Triage) و بافت هر یافته را درک کنید. مثلاً ممکن است یک memcpy ناامن در یک فایل، قبلاً با بررسی اندازه (Size Check) در جای دیگری تعدیل شده باشد. می‌توانید قوانین را برای کاهش مثبت‌های کاذب با محدود کردن معیارهای جستجو تنظیم کنید، اما این ریسک افزایش تعداد منفی‌های کاذب را نیز دارد و باعث می‌شود آسیب‌پذیری‌های واقعی را از دست بدهید.

خوشبختانه پژوهشگران زیادی پیش از شما همین مسیر را پیموده‌اند. اگرچه آن‌ها شاید پژوهش‌هایشان را با تمام جزئیات درباره آسیب‌پذیری‌های کشف‌شده منتشر نکنند، نرم‌افزار متن‌باز دو سند مدرن کلیدی دارد که در دسترس شماست: تفاوت (Diff) کدِ وصله‌شده و اطلاعیه عمومی آسیب‌پذیری که معمولاً به‌صورت یک رکورد Common Vulnerabilities and Exposures (CVE) منتشر می‌شود (فصل ۰ را ببینید). با تحلیل این منابع اطلاعاتی، ممکن است بتوانید یک آسیب‌پذیری قبلی را به آسیب‌پذیری‌های جدید متعددی تبدیل کنید. در این بخش، نحوه انجام تحلیل واریانت درون یک کدبیس یا مخزن (Repository) منفرد و همچنین میان چندین مخزن را بررسی خواهیم کرد.

#### تحلیل واریانت تک‌مخزنی (Single-Repository Variant Analysis)

آسیب‌پذیری‌ها اغلب به‌صورت مجزا وجود ندارند. اگر توسعه‌دهنده‌ای در کد خود اشتباهی کرد که به آسیب‌پذیری منجر شد، احتمالاً همان اشتباه را در جای دیگری از کدبیس هم مرتکب شده است. علاوه بر این، ممکن است پژوهشگران آسیب‌پذیری به فهرست کردن همه واریانت‌های ممکن یک آسیب‌پذیری علاقه‌مند نباشند، بلکه بیشتر بخواهند یک مسیر بهره‌برداری خاص را کاوش کنند و با یافتن چیزی راضی باشند. در نهایت، توسعه‌دهندگان در عجله برای وصله یک باگ، ممکن است تحلیل ریشه‌ای عمیق‌تری درباره علت وقوع آن آسیب‌پذیری انجام ندهند و سپس نگهبانهای امنیتی (Guardrail) برای پیشگیری از تکرار نسازند. این عوامل می‌توانند منبعی شگفت‌انگیز غنی از آسیب‌پذیری‌ها ایجاد کنند و رویکردی کم‌هزینه‌تر برای پژوهش آسیب‌پذیری تسهیل شوند. راه‌هایی که می‌توانید دنبال کنید عبارت‌اند از:

- **واریانت‌ها (Variants):** الگوی کد مشخصی که عامل یک آسیب‌پذیری بوده، در جای دیگری از کد نیز وجود دارد و آسیب‌پذیری‌های بیشتری ایجاد می‌کند.
- **وصله‌های ناکافی (Insufficient Patches):** وصله‌ای برای یک آسیب‌پذیری علت ریشه‌ای را به‌طور کامل برطرف نمی‌کند و راه‌های دورزدن (Bypass) متعددی باقی می‌گذارد تا آسیب‌پذیری همچنان قابل بهره‌برداری باشد.
- **بازگشت (Regression):** آسیب‌پذیری در کد وصله می‌شود اما به دلیل نبود تست رگرسیون یا نگهبانهای امنیتی، هنگام تغییرات بعدیِ کد که وصله را تضعیف یا حذف می‌کنند، دوباره احیا می‌شود.

به لطف اطلاعیه آسیب‌پذیری و تفاوت کدِ وصله‌شده که پیش‌تر mention شد، دقیقاً می‌دانید آسیب‌پذیری اصلی چگونه و چرا رخ می‌دهد. با کمی تحلیل ریشه‌ای، می‌توانید به‌سرعت به غربال کد برای الگوهای آسیب‌پذیر مشابه بپردازید. پس از آن، می‌توانید نتایج را بر اساس این‌که آیا آسیب‌پذیری اصلی را تکرار می‌کنند یا خیر دسته‌بندی کنید، به‌جای آنکه هر بار تحلیل را از صفر شروع کنید. قوانینی که می‌نویسید می‌توانند بسیار خاص‌تر از الگوهایی باشند که در یک مجموعه قوانین عمومی معنا ندارند.

می‌توانید این روش را با مجموعه‌ای از واریانت‌های آسیب‌پذیری سرریز عدد صحیح (Integer Overflow) در Expat — یک کتابخانه C برای پردازش فایل‌های XML — امتحان کنید. با توجه به فراگیری فایل‌های XML، Expat در نرم‌افزارهای بی‌شماری از جمله Firefox و پایتون کاربرد دارد (https://libexpat.github.io/doc/users/). بنابراین یک آسیب‌پذیری در Expat اثرات پایین‌دستی (Downstream) جدی دارد، به‌خصوص که می‌توانید از این کتابخانه به روش‌هایی استفاده کنید که توسعه‌دهندگان اصلی شاید انتظارش را نداشته باشند. اگر به CVEهای Expat نگاهی بیندازید، متوجه می‌شوید که از سرریزهای عدد صحیح متعددی رنج برده است، از جمله CVE-2022-22822 تا CVE-2022-22827 (https://cve.mitre.org/cgi-bin/cvekey.cgi?keyword=expat). اگر به صفحات مجزای این آسیب‌پذیری‌ها سر بزنید، زیر بخش «References» پیوندی به کامیت ادغام‌شده (Merged Commit) روی GitHub می‌بینید که آسیب‌پذیری را وصله کرده است. برای وصله مشترک CVE-2022-22822 تا CVE-2022-22827 با عنوان «[CVE-2022-22822 to CVE-2022-22827] lib: Prevent more integer overflows»، کامنت Pull Request اشاره می‌کند که این وصله به Pull Requestهای 534 و 538 مربوط است. این Pull Requestها به نوبه خود، سرریزهای عدد صحیح قدیمی‌تر در CVE-2021-46143 و CVE-2021-45960 را وصله کرده‌اند.

##### تحلیل ریشه‌ای (Root Cause Analysis)

برای تمرین تحلیل واریانت تک‌مخزنی، سعی کنید واریانت‌های CVE-2022-22822 تا CVE-2022-22827 را با نوشتن یک قانون تحلیل کد بر اساس CVE-2021-46143 دوباره کشف کنید. گام اول در نوشتن قانون، انجام تحلیل ریشه‌ای برای درک نحوه وقوع آسیب‌پذیری و تعیین الگوهای هدف است.

به وصله CVE-2021-46143 در https://github.com/libexpat/libexpat/pull/538 نگاهی بیندازید. عنوان Pull Request چنین است: «[CVE-2021-46143] lib: Prevent integer overflow on m_groupSize in function doProlog». بخش «Files changed» فقط دو فایل به‌روزشده را فهرست می‌کند. گزارش تغییرات (Changelog) این خطوط را اضافه می‌کند:

\`\`\`text
+ #532 #538CVE-2021-46143 (ZDI-CAN-16157) -- Fix integer overflow
+ on variable m_groupSize in function doProlog leading
+ to realloc acting as free.
+ Impact is denial of service or more.
\`\`\`

این به‌طور مفید به شما می‌گوید که سرریز عدد صحیح در CVE-2021-46143 به «عمل کردن realloc به‌عنوان free» می‌انجامد. تابع کتابخانه استاندارد realloc دو آرگومان می‌پذیرد: void *ptr و size_t size. همان‌طور که در صفحه راهنمای آن اشاره شده، این تابع تلاش می‌کند اندازه حافظه تخصیص‌یافته‌ای که ptr به آن اشاره می‌کند را به size تغییر دهد، اما اگر size صفر باشد، به‌جای آن حافظه را آزاد (Free) می‌کند. می‌توانید اطلاعات بیشتری از تفاوت (Diff) فایل به‌روزشده دیگر یعنی expat/lib/xmlparse.c استخراج کنید:

\`\`\`diff
@@ -5019,6 +5046,11 @@ doProlog
   if (parser->m_prologState.level >= parser->m_groupSize) {
     if (parser->m_groupSize) {
       {
+        /* Detect and prevent integer overflow */
+❶        if (parser->m_groupSize > (unsigned int)(-1) / 2u) {
+          return XML_ERROR_NO_MEMORY;
+        }
+
         char *const new_connector = (char *)REALLOC(
             parser, parser->m_groupConnector, parser->m_groupSize *= 2);
         if (new_connector == NULL) {
@@ -5029,6 +5061,16 @@ doProlog
     }
     if (dtd->scaffIndex) {
+      /* Detect and prevent integer overflow.
+       * The preprocessor guard addresses the "always false" warning
+       * from -Wtype-limits on platforms where
+       * sizeof(unsigned int) < sizeof(size_t), e.g. on x86_64. */
+#if UINT_MAX >= SIZE_MAX
+❷        if (parser->m_groupSize > (size_t)(-1) / sizeof(int)) {
+        return XML_ERROR_NO_MEMORY;
+      }
+#endif
+
       int *const new_scaff_index = (int *)REALLOC(
           parser, dtd->scaffIndex, parser->m_groupSize * sizeof(int));
       if (new_scaff_index == NULL)
\`\`\`

این به شما دقیقاً می‌گوید وصله کجا اعمال شده و مهم‌تر از آن، چه چیزی را وصله می‌کند. در این مورد، دو بررسی مقایسه‌ای روی parser->m_groupSize اضافه می‌کند تا مطمئن شود این مقدار بزرگ‌تر از (unsigned int)(-1) / 2u ❶ یا (size_t)(-1) / sizeof(int) ❷ نیست — همان مقادیری که parser->m_groupSize پیش از پاس دادن به‌عنوان آرگومان size به ماکرو REALLOC در آن‌ها ضرب می‌شود.

لحظه‌ای به تحلیل ماکرو REALLOC بپردازید. در زبان برنامه‌نویسی C، ماکروها قطعه‌های نام‌دارِ کد هستند. برای یافتن تعریف ماکرو REALLOC، عبارت #define REALLOC را در کد جستجو کنید:

\`\`\`c
#define REALLOC(parser, p, s) (parser->m_mem.realloc_fcn((p), (s)))
\`\`\`

هنگام کامپایل کد، پیش‌پردازنده C همه وقوع‌های REALLOC و آرگومان‌هایشان را به (parser->m_mem.realloc_fcn((p), (s))) بسط می‌دهد. اما این تأیید نمی‌کند که m_mem.realloc_fcn معادل تابع کتابخانه استاندارد realloc است. اگر realloc_fcn را در کد جستجو کنید، به این می‌رسید:

\`\`\`c
parserCreate(const XML_Char *encodingName,
             const XML_Memory_Handling_Suite *memsuite,
             const XML_Char *nameSep,
             DTD *dtd) {
    XML_Parser parser;
    if (memsuite) { ❶
        XML_Memory_Handling_Suite *mtemp;
        parser = (XML_Parser)memsuite->malloc_fcn(sizeof(struct XML_ParserStruct));
        if (parser != NULL) {
            mtemp = (XML_Memory_Handling_Suite *)&(parser->m_mem);
            mtemp->malloc_fcn = memsuite->malloc_fcn;
            mtemp->realloc_fcn = memsuite->realloc_fcn;
            mtemp->free_fcn = memsuite->free_fcn;
        }
    } else {
        XML_Memory_Handling_Suite *mtemp;
        parser = (XML_Parser)malloc(sizeof(struct XML_ParserStruct));
        if (parser != NULL) {
            mtemp = (XML_Memory_Handling_Suite *)&(parser->m_mem);
            mtemp->malloc_fcn = malloc;
            mtemp->realloc_fcn = realloc; ❷
            mtemp->free_fcn = free;
        }
    }
\`\`\`

مگر اینکه مجموعه مدیریت حافظه جایگزینی به parserCreate ❶ پاس دهید، realloc_fcn به realloc ❷ نسبت داده می‌شود. شاید این مسیر طولانی برای تأیید شک‌تان به نظر برسد، اما دقت و جامعیت اهمیت دارد. مگر اینکه ماکرو REALLOC می‌توانست یک Wrapper امن دور تابع realloc باشد؛ رویه‌ای رایج در میان بسیاری از توسعه‌دهندگان.

با بازگشت به وصله CVE-2021-46143، شاید از خود بپرسید بررسی‌های مقایسه‌ای چگونه از سرریز عدد صحیح جلوگیری می‌کنند، یا اصلاً سرریز عدد صحیح در این بستر چه معنایی دارد. به‌عنوان یک آزمایش سریع، کد C زیر را کامپایل و اجرا کنید:

\`\`\`c
#include <stdio.h>
int main() {
    printf("SIZE_MAX: %zu\\n", ((size_t)(-1)));
    printf("no overflow: %zu\\n", ((size_t)(-1) / sizeof(int)) * sizeof(int));
    printf("overflow: %zu\\n", ((size_t)(-1) / sizeof(int) + 1) * sizeof(int));
    return 0;
}
\`\`\`

باید خروجی زیر را بگیرید:

\`\`\`text
SIZE_MAX: 18446744073709551615
no overflow: 18446744073709551612
overflow: 0
\`\`\`

اعداد صحیح بدون علامت حداکثر مقداری دارند که می‌توانند بازنمایی کنند که در باینری به شکل 11111... است تا تعداد بیت‌های آن نوع. از آنجا که اعداد صحیح بدون علامت نمی‌توانند منفی باشند، تبدیل (Cast) مقدار -1 به یک نوع صحیح بدون علامت، عمل مکمل دو (Two's Complement) را انجام می‌دهد که به همان نمایش باینریِ حداکثر مقدار آن نوع ختم می‌شود.

در حساب باینری، ضرب در دو با «شیفت به چپ» به اندازه ۱ بیت نشان داده می‌شود و تقسیم بر دو (با گرد کردن به پایین) عکس آن است. برای مثال، ضرب ۷ (111 در باینری) در دو نتیجه‌اش 1110 می‌شود که معادل ۱۴ است. اگر عملیات از تعداد بیت‌های نوع مورد نظر فراتر رود، بیت‌های با اهمیت بالا (Most Significant Bits) بریده می‌شوند. بنابراین سرریز عدد صحیح بدون علامت در اینجا زمانی رخ می‌دهد که حاصل‌ضرب به 1000000... برسد که به 000000... بریده می‌شود؛ یعنی مقدار ۰. سرریزهای عدد صحیح یک کلاس رایج آسیب‌پذیری هستند که اگر مقدار در توابع دیگر استفاده شود، می‌توانند به انواع رفتار نامشخص (Undefined Behavior) منجر شوند؛ در مورد Expat، می‌تواند به آزادسازی حافظه به‌جای تخصیص مجدد آن بینجامد.

برای کامل کردن تحلیل ریشه‌ای، باید بفهمید چگونه می‌توان به این مسیر کد آسیب‌پذیر — یعنی چاهک — رسید. خوشبختانه کامنت Pull Request به Issue متناظر هم پیوند دارد با عنوان «[CVE-2021-46143] Crafted XML file can cause integer overflow on m_groupSize in function doProlog» (https://github.com/libexpat/libexpat/issues/532). این Issue اشاره می‌کند که یک پژوهشگر کلاه‌سفید ناشناس، آسیب‌پذیری را از طریق Zero Day Initiative (ZDI) گزارش کرده است؛ سازمانی که افشای آسیب‌پذیری‌های روز صفر را تسهیل و پاداش مالی ارائه می‌کند. همچنین ذکر شده که «مسئله، یک سرریز عدد صحیح (در ضرب) نزدیک به فراخوانی realloc است که یک فایل XML دستکاری‌شده با اندازه ۲ GiB می‌گیرد و سپس باعث انکار سرویس (Denial of Service) یا بیشتر می‌شود.» در نهایت، کامنت Issue شامل قطعه‌ای از بخش تحلیلِ اطلاعیه افشای آسیب‌پذیری است:

«این یک آسیب‌پذیری سرریز عدد صحیح است که در کتابخانه expat وجود دارد. تابع آسیب‌پذیر doProlog است:


\`\`\`javascript
doProlog(XML_Parser parser, const ENCODING *enc, const char *s, const char *end,
        int tok, const char *next, const char **nextPtr, XML_Bool haveMore,
        XML_Bool allowClosingDoctype, enum XML_Account account) {
#ifdef XML_DTD
    static const XML_Char externalSubsetName[] = { ASCII_HASH, '\\0' };
#endif /* XML_DTD */
    static const XML_Char atypeCDATA[]
    --snip--
    case XML_ROLE_GROUP_OPEN:
        if (parser->m_prologState.level >= parser->m_groupSize) {
            if (parser->m_groupSize) {
                {
                    char *const new_connector = (char *)REALLOC(
                        parser, parser->m_groupConnector, parser->m_groupSize *= 2);  // (1)
                    if (new_connector == NULL) {
                        parser->m_groupSize /= 2;
                        return XML_ERROR_NO_MEMORY;
                    }
                    parser->m_groupConnector = new_connector;
                }
\`\`\`

«در نقطه (1)، اگر مقدار m_groupSize بزرگ‌تر از 0x7FFFFFFF باشد، سرریز عدد صحیح رخ می‌دهد.»

این آخرین قطعه پازل را در اختیار شما می‌گذارد: بردار حمله، یعنی یک فایل XML دستکاری‌شده بزرگ. برای اینکه m_groupSize به چنین عدد بزرگی برسد، فایل XML باید توکن‌های کافی مطابق با case مربوط به XML_ROLE_GROUP_OPEN داشته باشد.

لازم نیست در طول تحلیل ریشه‌ای، اثبات مفهوم (Proof of Concept) را دوباره بسازید، اما انجام این کار می‌تواند در بهبود درک شما از آسیب‌پذیری مفید باشد. سعی کنید CVE-2021-46143 را با ساختن فایل XML‌ای که آن را فعال کند بازتولید کنید. راهنمایی: به Pull Request و Issue مربوط به CVE-2021-45960 نگاهی بیندازید که جزئیات بیشتری درباره اثبات مفهوم دارد و پیوندی به اسکریپت ساختن آن شامل می‌شود. می‌توانید آن را برای CVE-2021-46143 تطبیق دهید.

اگرچه Expat فرایند رفع آسیب‌پذیری خود را به‌طور گسترده مستند می‌کند، در بیشتر مواقع فقط خرده‌اطلاعاتی از اطلاعیه‌های منتشرشده آسیب‌پذیری در اختیار خواهید داشت. بسته به بحرانیت یک باگ، توسعه‌دهندگان ممکن است انتخاب کنند وصله آسیب‌پذیری را با دفن کردنش در یک به‌روزرسانی بسیار بزرگ‌تر پنهان (Obfuscate) کنند یا آن را در سطحی بالاتر از کد برطرف کنند. علاوه بر این، توضیحات اطلاعیه آسیب‌پذیری ممکن است عمداً مبهم باشند تا از استنتاج آسیب‌پذیری واقعی توسط بازیگران مخرب و بهره‌برداری از آن از طریق حملات n-day روی کاربرانِ بدون وصله جلوگیری شود. با این وجود، معمولاً وصله یک آسیب‌پذیری شناخته‌شده را گرفتن و تحلیل کردنش، آسان‌تر از کشف یک آسیب‌پذیری کاملاً جدید است. تحلیل ریشه‌ای آسیب‌پذیری‌های افشاشده مهارتی است که برای پژوهشگر دقیق، دستاوردی غنی دارد.

##### تطبیق الگوی واریانت‌ها (Variant Pattern Matching)

اکنون که علت ریشه‌ای آسیب‌پذیری را می‌فهمید، می‌توانید الگویی بنویسید تا واریانت‌های دیگر آن را در کد پیدا کنید. جمع‌بندی ویژگی‌های کلیدی این آسیب‌پذیری چنین است:

1. سرریز عدد صحیح زمانی رخ می‌دهد که متغیری از نوع صحیح بدون علامت در ضرب، از حداکثر مقدارش فراتر رود.
2. عدد صحیح سرریزشده به‌عنوان آرگومان سوم به ماکرو REALLOC پاس داده می‌شود که اگر متغیر به ۰ سرریز شود، به یک free غیرمنتظره منجر می‌گردد.
3. متغیر از طریق فایل XML تحت کنترل مهاجم است و می‌تواند به شکل parser->m_groupSize باشد.

معمولاً برای تحلیل واریانت تک‌مخزنی می‌توانید در نوشتن الگوها دقیق‌تر باشید، زیرا سبک توسعه‌دهنده اغلب در سراسر کد تکرار می‌شود. ابتدا با یک تطبیق تقریباً دقیق از کد آسیب‌پذیر اصلی شروع کنید، سپس قانون را به‌آرامی عمومی‌تر کنید تا شروع به یافتن واریانت‌ها کنید. این رویکرد تکراری به شما اطمینان می‌دهد که از ابتدا بیش از حد تعمیم نمی‌دهید و دامنه‌تان را کوچک نگه می‌دارد. بنابراین بهتر است با تطبیق الگو شروع کنید نه یک قانون کامل تحلیل جریان داده. در این مورد، بر چاهک آسیب‌پذیری تمرکز کنید نه جریان منبع-به-چاهک.

برای CVE-2021-46143، چاهک، آرگومان سوم ماکرو REALLOC است که توسعه‌دهندگان با افزودن یک بررسی مقایسه‌ای درست قبل از دو فراخوانی REALLOC آن را وصله کردند:

\`\`\`javascript
char *const new_connector = (char *)REALLOC(
    parser, parser->m_groupConnector, parser->m_groupSize *= 2);
int *const new_scaff_index = (int *)REALLOC(
    parser, dtd->scaffIndex, parser->m_groupSize * sizeof(int));
\`\`\`

هنگام نوشتن قواعد Semgrep، استفاده از Semgrep Playground مفید است، زیرا از قابلیت‌های Semgrep Pro پشتیبانی و رابط کاربری مناسبی برای دیباگ قواعد دارد. نوشتن قاعده را با قرار دادن این دو فراخوانی REALLOC در بخش کد تستِ Playground شروع کنید. در بخش قاعده، به تب «advanced» بروید و با یک قاعده اسکلتی که دقیقاً با فراخوانی اول مطابقت دارد شروع کنید:

\`\`\`yaml
rules:
  - id: CVE-2021-46143
    pattern: REALLOC(parser, parser->m_groupConnector, parser->m_groupSize *= 2);
    message: Detected variant of CVE-2021-46143.
    languages: [c]
    severity: ERROR
\`\`\`

روی Run کلیک کنید و مطمئن شوید قاعده با خطی که اولین فراخوانی REALLOC در آن است مطابقت دارد. سپس قانون را عمومی‌تر کنید تا با هر دو فراخوانی تطبیق یابد. می‌توانید این کار را با انتزاعی کردن دو آرگومان آخر با عملگر سه‌نقطه انجام دهید، زیرا آن‌ها تنها تفاوت میان فراخوانی اول و دوم‌اند:

\`\`\`text
pattern: REALLOC(parser, ...);
\`\`\`

اگرچه این کار می‌کند، تعداد مثبت‌های کاذب را به‌شدت افزایش می‌دهد. به یاد داشته باشید علت ریشه‌ای این آسیب‌پذیری، سرریز عدد صحیح در آرگومان سومِ پاس‌داده‌شده به REALLOC (و در نتیجه realloc) است که از ضرب کردن آن ناشی می‌شود (parser->m_groupSize *= 2 و parser->m_groupSize * sizeof(int)). بنابراین باید این الگو را با استفاده از متغیرهای فرا تطبیق دهید:

\`\`\`text
patterns:
  - pattern-either:
    - pattern: REALLOC(parser, $POINTER, $SIZE * $CONSTANT);
    - pattern: REALLOC(parser, $POINTER, $SIZE *= $CONSTANT);
\`\`\`

به استفاده صحیح از عملگرهای patterns، pattern-either و pattern توجه کنید. نمی‌توانید دو عملگر pattern را زیر patterns تو در تو کنید، زیرا patterns عملگر منطقی AND را اعمال می‌کند؛ یعنی کد باید با هر دو الگو تطبیق یابد نه با یکی از آن‌ها. برای انجام عملگر منطقی OR از pattern-either استفاده کنید.

پس از کامل شدن این قاعده پایه، اکنون می‌توانید آن را روی کامیت آسیب‌پذیر Expat تست کنید. قاعده را در فایلی به نام cve-2021-46143-variant-1.yml ذخیره کنید (یا از مخزن کد کتاب کپی کنید)، سپس کامیت را checkout و قاعده Semgrep را با دستورات زیر روی آن اجرا کنید:

\`\`\`bash
$ git clone https://github.com/libexpat/libexpat
$ cd libexpat
$ git checkout 0adcb34c
$ semgrep -f ../cve-2021-46143-variant-1.yml .
\`\`\`

اگر همه‌چیز خوب پیش برود، باید نتایج زیر را بگیرید:

\`\`\`javascript
Scanning 18 files.
18/18 tasks 0:00:00
Results
Findings:
expat/lib/xmlparse.c
CVE-2021-46143
Detected variant of CVE-2021-46143.
 3271 temp = (ATTRIBUTE *)REALLOC(parser, (void *)parser->m_atts,
 3272     parser->m_attsSize * sizeof(ATTRIBUTE));
 ----------------------------------------
 3279 temp2 = (XML_AttrInfo *)REALLOC(parser, (void *)parser->m_attInfo,
 3280     parser->m_attsSize * sizeof(XML_AttrInfo));
 ----------------------------------------
 5049 char *const new_connector = (char *)REALLOC(
 5050     parser, parser->m_groupConnector, parser->m_groupSize *= 2);
 ----------------------------------------
 5059 int *const new_scaff_index = (int *)REALLOC(
 5060     parser, dtd->scaffIndex, parser->m_groupSize * sizeof(int));
 6130 temp = (DEFAULT_ATTRIBUTE *)REALLOC(parser, type->defaultAtts,
 6131     (count * sizeof(DEFAULT_ATTRIBUTE)));
 ----------------------------------------
 7131 temp = (CONTENT_SCAFFOLD *)REALLOC(
 7132     parser, dtd->scaffold, dtd->scaffSize * 2 * sizeof(CONTENT_SCAFFOLD));
Scan Summary
Some files were skipped or only partially analyzed.
Scan was limited to files tracked by git.
Partially scanned: 1 files only partially analyzed due to a parsing or internal Semgrep error
Scan skipped: 6 files matching .semgrepignore patterns
For a full list of skipped files, run semgrep with the --verbose flag.
Ran 1 rule on 18 files: 6 findings.
\`\`\`

این قاعده به‌درستی دو آسیب‌پذیری اصلی را به‌همراه چهار واریانت بالقوه اضافی شناسایی می‌کند. همه واریانت‌ها از مقداری استفاده می‌کنند که بالقوه تحت کنترل مهاجم است و در اندازه یک ساختار داده ضرب می‌شود.

به اولین واریانت نگاه دقیق‌تری بیندازید که در خط 3271 از xmlparse.c رخ می‌دهد:

\`\`\`javascript
/* Precondition: all arguments must be non-NULL;
Purpose:
- normalize attributes
- check attributes for well-formedness
- generate namespace aware attribute names (URI, prefix)
- build list of attributes for startElementHandler
- default attributes
- process namespace declarations (check and report them)
- generate namespace aware element name (URI, prefix)
*/
static enum XML_Error
storeAtts(XML_Parser parser, const ENCODING *enc, const char *attStr,
          TAG_NAME *tagNamePtr, BINDING **bindingsPtr,
          enum XML_Account account) {
    DTD *const dtd = parser->m_dtd;      /* save one level of indirection */
    ELEMENT_TYPE *elementType;
    int nDefaultAtts;
    const XML_Char **appAtts;            /* the attribute list for the application */
    int attIndex = 0;
    int prefixLen;
    int i;
    int n;
    XML_Char *uri;
    int nPrefixes = 0;
    BINDING *binding;
    /* lookup the element type name */
    elementType = (ELEMENT_TYPE *)lookup(parser, &dtd->elementTypes, tagNamePtr->str, 0);
    if (! elementType) {
        const XML_Char *name = poolCopyString(&dtd->pool, tagNamePtr->str);
        if (! name)
            return XML_ERROR_NO_MEMORY;
        elementType = (ELEMENT_TYPE *)lookup(parser, &dtd->elementTypes, name, sizeof(ELEMENT_TYPE));
        if (! elementType)
            return XML_ERROR_NO_MEMORY;
        if (parser->m_ns && ! setElementTypePrefix(parser, elementType))
            return XML_ERROR_NO_MEMORY;
    }
❶    nDefaultAtts = elementType->nDefaultAtts;
    /* get the attributes from the tokenizer */
❷    n = XmlGetAttributes(enc, attStr, parser->m_attsSize, parser->m_atts);
    if (n + nDefaultAtts > parser->m_attsSize) {
        int oldAttsSize = parser->m_attsSize;
        ATTRIBUTE *temp;
#ifdef XML_ATTR_INFO
        XML_AttrInfo *temp2;
#endif
❸        parser->m_attsSize = n + nDefaultAtts + INIT_ATTS_SIZE;
        temp = (ATTRIBUTE *)REALLOC(parser, (void *)parser->m_atts,
❹            parser->m_attsSize * sizeof(ATTRIBUTE));
\`\`\`

با کسب تجربه، شهودیتی خواهید ساخت درباره اینکه یک قطعه کد خاص چه می‌کند بدون آنکه مجبور باشید همه‌چیز را فهرست کنید؛ این مهارت هر بار که با کد منبع پیچیده‌تری روبه‌رو می‌شوید به کارتان می‌آید. Expat کدبیسی نسبتاً سرراست محسوب می‌شود که بیشتر منطقش در یک فایل واحد است.

حتی با اطلاعات ناقص، می‌توانید سرنخ‌هایی درباره آسیب‌پذیر بودن کد به دست آورید. نخست، تابع storeAtts که واریانت بالقوه در آن رخ می‌دهد، با کامنتی شامل جزئیات کارکردش مستند شده است. به‌طور خلاصه، به نظر می‌رسد پردازش اتریبیوت‌های XML را مدیریت می‌کند که اگر کتابخانه در حال مدیریت اسناد XML غیرقابل‌اعتماد باشد، این اتریبیوت‌ها واقعاً تحت کنترل مهاجم خواهند بود.

به‌طور خاص، به parser->m_attsSize علاقه‌مند خواهید بود نه sizeof(ATTRIBUTE)؛ زیرا اگرچه هر دو در آرگومان سوم REALLOC (یعنی چاهک) ❹ استفاده می‌شوند، اولی بالقوه تحت کنترل مهاجم است در حالی که دومی یک مقدار ثابت است.

چند خط بالاتر برگردید: parser->m_attsSize به جمع چند متغیر تنظیم می‌شود ❸. می‌توانید INIT_ATTS_SIZE را که یک ثابت است نادیده بگیرید. در همین حین، nDefaultAtts به مقداری دیگر تنظیم می‌شود ❶ و بر اساس نام متغیرها می‌توان حدس معقولی زد که این مقدار برابر تعداد اتریبیوت‌های پیش‌فرض نوع عنصری است که در حال پردازش است. این حدس را می‌توان برای بررسی بعدی کنار گذاشت. در نهایت، n به مقدار بازگشتی یک تابع ❷ تنظیم می‌شود که طبق کامنت، اتریبیوت‌ها را از توکنایزر می‌گیرد. اگر XmlGetAttributes را جستجو کنید، خواهید دید که در واقع یک ماکرو است که در expat/lib/xmltok.h تعریف شده:

\`\`\`c
#define XmlGetAttributes(enc, ptr, attsMax, atts) \\
    (((enc)->getAtts)(enc, ptr, attsMax, atts))
\`\`\`

این ماکرو عملاً تابع عضو getAtts از نمونه struct یعنی enc را با همان آرگومان‌ها فراخوانی می‌کند. جستجوی getAtts پیاده‌سازی واقعی تابع را در expat/lib/xmltok_impl.c نشان می‌دهد. اگرچه می‌توانید کد را کامل خودتان تحلیل کنید، کامنت بالای تعریف تابع برای فهم کارکردش کافی است:

\`\`\`text
/* This must only be called for a well-formed start-tag or empty
element tag. Returns the number of attributes. Pointers to the
first attsMax attributes are stored in atts.
*/
\`\`\`

خوشبختانه این نشان می‌دهد که n واقعاً مقداری تحت کنترل مهاجم است، زیرا تعداد اتریبیوت‌های عنصر XML‌ای است که در حال پردازش است.

اگرچه attsMax در ابتدا نگرانی‌ای ایجاد کرد چون می‌توانست بالقوه تعداد اتریبیوت‌های برگردانده‌شده را محدود کند، کامنت می‌گوید که فقط تعداد اتریبیوت‌های ذخیره‌شده در atts را محدود می‌کند. می‌توانید این را با مشاهده اینکه تابع مقدار بازگشتی nAtts را صرف‌نظر از اینکه از attsMax عبور کرده یا نه، افزایش می‌دهد تأیید کنید:

\`\`\`text
case BT_QUOT:
    if (state != inValue) {
        if (nAtts < attsMax)
            atts[nAtts].valuePtr = ptr + MINBPC(enc);
        state = inValue;
        open = BT_QUOT;
    } else if (open == BT_QUOT) {
        state = other;
        if (nAtts < attsMax)
            atts[nAtts].valueEnd = ptr;
        nAtts++;
    }
    break;
\`\`\`

برای مثال، اگرچه بررسی می‌کند که nAtts < attsMax، دستور nAtts++; خارج از بدنه if قرار دارد و صرف‌نظر از نتیجه شرط اجرا می‌شود. در C، فقط دستورِ بلافاصله بعد از if اجرا می‌شود مگر آنکه داخل آکولاد قرار گیرد.

این تأیید می‌کند که مقدار نهایی پاس‌داده‌شده به‌عنوان آرگومان سوم به REALLOC، تا حدی تحت کنترل مهاجم است و یک آسیب‌پذیری معتبر محسوب می‌شود. ما اینجا راه طولانی‌ای رفتیم، اما همان‌طور که قبلاً برجسته شد، می‌توانید با اتکا به نام متغیرها و کامنت‌های توسعه‌دهنده، برخی گام‌ها را رد کنید. این یک تصمیم قضاوتی است که باید بر اساس اندازه کدبیس و زمانی که می‌توانید صرف کنید، بگیرید.


به Pull Request‌ای که CVE-2022-22822 تا CVE-2022-22827 را برطرف کرد نگاهی بیندازید: می‌بینید که پیش از فراخوانی REALLOC در storeAtts یک بررسی اعتبارسنجی اضافه کرده است (https://github.com/libexpat/libexpat/pull/539/files#diff-d1bcab18f24ba66b34aeb2e156f7fde58ef3de1a165514b0fccf0d04c26838f8R3289-R3294):

\`\`\`c
+/* Detect and prevent integer overflow */
+if ((nDefaultAtts > INT_MAX - INIT_ATTS_SIZE)
+    || (n > INT_MAX - (nDefaultAtts + INIT_ATTS_SIZE))) {
+  return XML_ERROR_NO_MEMORY;
+}
+
 parser->m_attsSize = n + nDefaultAtts + INIT_ATTS_SIZE;
+
+/* Detect and prevent integer overflow.
+ * The preprocessor guard addresses the "always false" warning
+ * from -Wtype-limits on platforms where
+ * sizeof(unsigned int) < sizeof(size_t), e.g. on x86_64. */
+#if UINT_MAX >= SIZE_MAX
+if ((unsigned)parser->m_attsSize > (size_t)(-1) / sizeof(ATTRIBUTE)) {
+  parser->m_attsSize = oldAttsSize;
+  return XML_ERROR_NO_MEMORY;
+}
+#endif
\`\`\`

توضیح CVE-2022-22827 چنین می‌گوید: «storeAtts در xmlparse.c در Expat (معروف به libexpat) قبل از نسخه 2.4.3 دارای یک سرریز عدد صحیح است.» این تأیید می‌کند که قاعده شما توانست واریانت واقعی‌ای از CVE-2021-46143 را شناسایی کند. بر اساس نتایج دیگر، قاعده سرریزهای عدد صحیح در defineAttribute (CVE-2022-22824) و nextScaffoldPart (CVE-2022-22826) را نیز به‌درستی شناسایی می‌کند، اما آن‌هایی که در addBinding (CVE-2022-22822)، build_model (CVE-2022-22823) و lookup (CVE-2022-22825) هستند را نمی‌یابد. دو مورد اخیر به این دلیل است که عدد صحیح سرریزشده به فراخوانی malloc پاس داده می‌شود نه realloc. برای addBinding، کد مشکل‌ساز چنین است:

\`\`\`c
XML_Char *temp = (XML_Char *)REALLOC(
    parser, b->uri, sizeof(XML_Char) * (len + EXPAND_SPARE));
\`\`\`

*توجه کنید که اگر این کد را در فایل جداگانه‌ای به نام false_negative.c کپی و با قاعده Semgrep خود اسکن کنید، آسیب‌پذیری را شناسایی خواهد کرد. اگر به یاد دارید، پیام Partially scanned: 1 files only partially analyzed due to a parsing or internal Semgrep error در خروجی قبلی Semgrep نشان داد که موتور Semgrep هنوز از زبان C به‌طور کامل پشتیبانی نمی‌کند و ممکن است در پردازش صحیح بخش‌هایی از کد شکست بخورد. علاوه بر این، بازنمایی عمومی Semgrep از کد ممکن است به دلیل مبادلات طراحی‌اش، همه ظرافت‌های زبان برنامه‌نویسی C را در نیابد. از قابلیت dump-ast در Semgrep استفاده کنید:*

\`\`\`text
$ semgrep --lang c --dump-ast false_negative.c
❶Call(
    N(
        Id(("REALLOC", ()),
        {id_info_id=3; id_hidden=false; id_resolved=Ref(
        None); id_type=Ref(None); id_svalue=Ref(
        None); })),
    [Arg(
        N(
            Id(("parser", ()),
            {id_info_id=4; id_hidden=false; id_resolved=Ref(
            None); id_type=Ref(None); id_svalue=Ref(
            None); })));
\`\`\`

در خروجی خلاصه‌شده، AST فراخوانی REALLOC با همان گره ❶ شروع می‌شود. Semgrep میان فراخوانی ماکرو و فراخوانی تابع تفاوتی قائل نمی‌شود؛ به همین دلیل ریشه این درخت، عنصر Call است.

با وجود محدودیت‌هایش، استفاده از یک موتور اسکن کد مانند Semgrep به شما امکان می‌دهد الگوهایی را اسکن کنید که فراتر از توان یک Regex ساده است. برای مثال، سناریوی دیگری را در نظر بگیرید که در آن، متغیر ابتدا نتیجه یک عملیات ضرب یا جمع را می‌گیرد و سپس به‌عنوان آرگومان سوم به REALLOC پاس داده می‌شود — به‌جای اینکه خودِ عملیات ضرب یا جمع مستقیماً آرگومان سوم REALLOC باشد. این همان آسیب‌پذیری سرریز عدد صحیح را ایجاد می‌کند اما الگوی عمومی‌تری می‌طلبد. برای بررسی این حالت، از عملگر pattern-inside به‌همراه متغیرهای فرا استفاده کنید:

\`\`\`yaml
rules:
  - id: CVE-2021-46143
    patterns:
❶      - pattern-either:
        - pattern-inside: |
❷            (int $SIZE) = $VARIABLE * $CONSTANT;
            ...
        - pattern-inside: |
            (int $SIZE) *= $CONSTANT;
            ...
        - pattern-inside: |
            (int $SIZE) = $VARIABLE + $CONSTANT;
            ...
        - pattern-inside: |
            (int $SIZE) += $CONSTANT;
            ...
❸      - pattern: REALLOC(parser, $POINTER, $SIZE);
    message: Detected variant of CVE-2021-46143.
    languages: [c]
    severity: ERROR
\`\`\`

در قاعده جدید، ببینید چگونه حالت‌های مختلف pattern-inside زیر pattern-either ❶ تو در تو شده‌اند و به عملیات Boolean دقت کنید. این قاعده از متغیرهای فرای نوع‌دار (Typed Metavariable) ❷ برای افزایش دقت استفاده می‌کند، زیرا سرریز عدد صحیح از نظر فنی باید فقط به متغیرهای صحیح محدود شود. همچنین از همان متغیر فرای $SIZE هم در pattern-inside و هم در عملگر pattern ❸ استفاده کرده تا آن‌ها را به هم پیوند دهد.

اگر این قاعده را روی مخزن اجرا کنید، باید دو نتیجه جدید بگیرید:

\`\`\`text
Scanning 19 files.
19/19 tasks 0:00:00
Results
Findings:
expat/lib/xmlparse.c
CVE-2021-46143
Detected variant of CVE-2021-46143.
 1938 temp = (char *)REALLOC(parser, parser->m_buffer, bytesToAllocate);
 ----------------------------------------
 2573 char *temp = (char *)REALLOC(parser, tag->buf, bufSize);
Scan Summary
Some files were skipped or only partially analyzed.
Scan was limited to files tracked by git.
Partially scanned: 1 files only partially analyzed due to a parsing or internal Semgrep error
Scan skipped: 6 files matching .semgrepignore patterns
For a full list of skipped files, run semgrep with the --verbose flag.
Ran 1 rule on 18 files: 2 findings.
\`\`\`

با تحلیل این نتایج، کشف خواهید کرد که یکی از آن‌ها در واقع سرریز عدد صحیح دیگری است که بعداً کشف شد (CVE-2022-25315). کمی وقت بگذارید و بفهمید چرا یک یافته مثبت واقعی است و دیگری مثبت کاذب. راهنمایی: آیا بررسی اعتبارسنجی‌ای قبل از فراخوانی REALLOC وجود دارد؟

پیش از پرداختن به تحلیل واریانت چندمخزنی، بیایید سریع مسیری را که برای کشف واریانت‌های CVE-2021-46143 پیمودید جمع‌بندی کنیم. نخست، با بررسی تفاوت‌های وصله و متادیتا مانند یادداشت‌های پچ، تحلیل ریشه‌ای آسیب‌پذیری اصلی را انجام دادید. سپس الگویی دقیق برای تطبیق چاهکِ آسیب‌پذیری نوشتید و به‌تدریج قانون را عمومی‌تر کردید تا واریانت‌های بیشتری را شکار کنید. می‌توانید قوانین را به اندازه دلخواه سخت‌گیرانه یا منعطف کنید. برای مثال، می‌توانید همه تطبیق‌هایی را که شامل بررسی اعتبارسنجی هستند با عملگر pattern-not-inside مستثنا کنید. با این حال، هر انتخاب طراحی، مبادله‌ای میان نرخ بالاتر مثبت کاذب و منفی کاذب ایجاد می‌کند.

#### تحلیل واریانت چندمخزنی (Multi-Repository Variant Analysis)

هنگام شکار واریانت‌های آسیب‌پذیری در یک مخزن واحد، می‌توانید قوانین اسکن کد عمومی‌تری بنویسید، زیرا اغلب مخزن‌ها به مجموعه‌ای از قراردادهای کدنویسی پایبندند که نگهدارندگان پروژه اعمال می‌کنند. متأسفانه به‌محض تلاش برای نوشتن قانونی برای شناسایی آسیب‌پذیری‌ها در چندین مخزن، به‌سرعت با انواع چالش‌ها روبه‌رو می‌شوید. راه‌های بی‌شماری وجود دارد که توسعه‌دهنده می‌تواند تابعی مانند realloc را فراخوانی کند؛ از ماکروها تا اشاره‌گرهای تابع. صرف جستجوی REALLOC خارج از کدبیس Expat کارساز نخواهد بود.

اگرچه «یک الگو برای حکمرانی بر همه» وجود ندارد، پژوهشگران می‌توانند قوانین خود را به سمت انتهای کم‌مثبت-کاذب و پراطمینان طیف تنظیم کنند. با اسکن هزاران مخزن در یک‌باره، می‌توانید نرخ بالاتر منفی‌های کاذب (از دست دادن آسیب‌پذیری‌های بالقوه) را با مقیاس عظیم جبران کنید؛ حتی نرخ موفقیت ۱ درصد یعنی حداقل ۱۰ آسیب‌پذیری جدید. با این حال، این منطق به دلیل ظرافت‌های هر آسیب‌پذیری کاملاً قابل انتقال نیست؛ قانونی که پیکربندی نادرست یک فریمورک خاص را هدف می‌گیرد، مخزن بالقوه بسیار کمتری خواهد داشت.

یک راه کاهش نرخ مثبت کاذب، استفاده از تحلیل جریان داده و ردیابی آلودگی به‌جای تطبیق الگوی محض است. برای این کار می‌توانید به قابلیت‌های قدرتمند جریان داده CodeQL پناه ببرید. خوشبختانه به‌جای رویارویی مستقیم با سینتکس پیچیده CodeQL، می‌توانید از کوئری‌های کتابخانه استاندارد موجود درباره سرریزهای عدد صحیحِ استفاده‌شده به‌عنوان اندازه تخصیص حافظه اقتباس کنید؛ مانند cpp/integer-overflow-tainted و cpp/uncontrolled-allocation-size. می‌توانید این دو کوئری را ساده و ترکیب کنید به این صورت:

\`\`\`sql
/**
 * @id integer-overflow-allocation-size
 * @name Integer Overflow in Allocation Size
 * @description Potential integer overflow passed to allocation size.
 * @kind path-problem
 * @severity error
 */
import cpp
import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis
import semmle.code.cpp.dataflow.new.TaintTracking
module IntegerOverflowConfig implements DataFlow::ConfigSig {
  predicate isSource(DataFlow::Node source) {
    exists(Expr e | e = source.asExpr() |
      (
        e instanceof UnaryArithmeticOperation or
        e instanceof BinaryArithmeticOperation or
        e instanceof AssignArithmeticOperation
      ) and
      convertedExprMightOverflow(e)
    )
  }
  predicate isSink(DataFlow::Node sink) {
    exists(Expr e, HeuristicAllocationExpr alloc | e = sink.asConvertedExpr() |
      e = alloc.getAChild() and
      e.getUnspecifiedType() instanceof IntegralType and
      not e instanceof Conversion
    )
  }
}
module IntegerOverflowFlow =
  TaintTracking::Global<IntegerOverflowConfig>;
import IntegerOverflowFlow::PathGraph
from IntegerOverflowFlow::PathNode source,
  IntegerOverflowFlow::PathNode sink
where IntegerOverflowFlow::flowPath(source, sink)
select sink.getNode(), source, sink,
  "Potential integer overflow $@ passed to allocation size $@.",
  source.getNode(), "source",
  sink, "sink"
\`\`\`

این قاعده را روی Expat با کامپایل دیتابیس به‌صورت codeql database create --language cpp --source-root expat expat-codeql-database در دایرکتوری ریشه Expat تست کنید، سپس آن را به فضای کاری CodeQL starter در VS Code اضافه کرده و کوئری را مانند بخش «CodeQL» اجرا کنید. اما نتیجه مورد انتظار را نخواهید گرفت، زیرا این کوئری فقط توابع تخصیص حافظه کتابخانه استاندارد را می‌جوید و فراخوانی ماکروها را دنبال نمی‌کند.

برای فعال کردن این قابلیت، باید isSink را به این شکل تغییر دهید:

\`\`\`text
predicate isSink(DataFlow::Node sink) {
  exists(Expr e, ExprCall ec, MacroInvocation mi | e = sink.asExpr() |
    ec = mi.getExpr() and
    mi.getMacroName() = "REALLOC" and
    e = ec.getAnArgument() and
    e.getUnspecifiedType() instanceof IntegralType
  )
}
\`\`\`

این تغییر همان‌طور که Semgrep کرد، برخی واریانت‌های آسیب‌پذیری را برمی‌گرداند. از آنجا که قرار است از CodeQL برای تحلیل واریانت چندمخزنی به‌جای تک‌مخزنی استفاده کنید، پیش از ادامه مطمئن شوید قاعده را به حالت عمومی‌ترِ چاهک‌های توابع تخصیص حافظه کتابخانه استاندارد برگردانده‌اید، نه ماکرو اختصاصی REALLOC مخصوص Expat.

با Semgrep، اسکن هزاران مخزن نسبتاً ساده است چون نیازی به مرحله ساخت دیتابیس ندارد. کافی است همه مخزن‌ها را کلون کنید و Semgrep را مستقیماً روی آن‌ها اجرا کنید. در مقابل، برای کار با CodeQL باید به‌صورت جداگانه برای هر مخزن یک دیتابیس بسازید، که اگر مخزنی فرایند بیلد غیراستاندارد یا وابستگی‌های شخص ثالث داشته باشد، ممکن است شکست بخورد. خوشبختانه تیم CodeQL در گیت‌هاب، دیتابیس‌های از-پیش-ساخته مخزن‌های برتر را فراهم کرده که به شما اجازه می‌دهد تا ۱٬۰۰۰ مخزن را از طریق گردش‌کارهای توزیع‌شده یکپارچه‌سازی و تحویل مستمر (CI/CD) معروف به GitHub Actions که در ابر اجرا می‌شوند، اسکن کنید.

برای راه‌اندازی تحلیل واریانت چندمخزنی با CodeQL و GitHub در VS Code، دستورالعمل‌های مستندات CodeQL را دنبال کنید (https://codeql.github.com/docs/codeql-for-visual-studio-code/running-codeql-queries-at-scale-with-mrva). هنگام راه‌اندازی مخزن کنترلر (Controller Repository)، حتماً مجوزهای Workflow را روی «Read and write permissions» تنظیم کنید. پس از راه‌اندازی اولیه، به VS Code برگردید و روی CodeQL در نوار Activity سمت چپ کلیک کنید. زیر «Variant Analysis Repositories» گزینه Top 100 repositories را انتخاب کنید.

در نهایت، در هر جای کوئری سفارشی سرریز عدد صحیح خود راست‌کلیک و CodeQL: Run Variant Analysis را انتخاب کنید. امیدواریم تحلیل واریانت چندمخزنی‌تان بدون دردسر شروع شود.

پس از چند دقیقه، شروع به دریافت نتایج خواهید کرد. تعداد نتایج کنار نام هر مخزن ظاهر می‌شود. می‌توانید یافته‌ها را باز کنید تا مسیرهای جریان داده در کد منبع را ببینید.

همان‌طور که می‌بینید، حتی با فقط ۱۰۰ مخزن، ده‌ها هزار نتیجه دریافت می‌کنید! دسته‌بندی همه این یافته‌ها در بازه زمانی محدود عملی نیست، اما اگر دقیق‌تر به نتایج نگاه کنید، متوجه می‌شوید که اعداد بسیار متفاوت‌اند؛ برخی مخزن‌ها هزاران نتیجه دارند در حالی که برخی کمتر از ۱۰. با توجه به اینکه مخزن‌هایی با هزاران نتیجه احتمال بالاترِ مثبت کاذب دارند، از مخزن‌هایی که یافته‌های کمتری دارند شروع کنید تا قاعده‌تان را دقیق‌تر کنید. الگوهای رایج اعتبارسنجی و مثبت‌های کاذب را بر اساس مجموعه اولیه نتایج فیلتر کنید و با دقیق‌تر شدن قاعده، به مخزن‌های بزرگ‌تر برسید. با مقیاس کافی، می‌توانید واریانت‌های واقعی کد آسیب‌پذیر را شناسایی کنید.

همچنین می‌توانید از جستجوی کد سفارشی گیت‌هاب برای پالایش فهرست مخزن‌هایی که می‌خواهید تحلیل کنید، به‌جای مخزن‌های برتر استفاده کنید. برای مثال، ممکن است بخواهید روی مخزن‌های XML برای آسیب‌پذیری‌های مخصوص XML تمرکز کنید.

### خلاصه (Summary)

ابزارهای خودکار تحلیل کد، روش‌های قدرتمندی برای تحلیل کد منبع در مقیاس بزرگ فراهم می‌کنند. مبادلاتی که می‌کنید و انواع قوانینی که می‌نویسید بسته به استراتژی شما متفاوت خواهد بود (تحلیل واریانت تک‌مخزنی تاکتیک‌های بسیار متفاوتی نسبت به تحلیل واریانت چندمخزنی می‌طلبد)، اما استفاده صحیح از این ابزارها به شما امکان می‌دهد با منابع محدود، بسیار کارآمدتر آسیب‌پذیری‌ها را کشف کنید.

در این فصل از ابزارهای تحلیل ایستای کد یعنی CodeQL و Semgrep برای خودکارسازی تحلیل واریانت استفاده کردید. یادداشت‌های وصله و تفاوت کدِ آسیب‌پذیری شناخته‌شده CVE-2021-46143 را تحلیل کردید تا علت ریشه‌ای را شناسایی کنید و سپس قاعده Semgrep‌ای نوشتید که با الگوی آسیب‌پذیر مطابقت داشت. علاوه بر این، با CodeQL کوئری‌های ردیابی آلودگی و جریان داده نوشتید که می‌توانستند تطبیق عمیق‌تر منبع-به-چاهک را در چندین فایل انجام دهند. در نهایت، با تحلیل واریانت چندمخزنی آزمایش کردید تا آسیب‌پذیری‌ها را در مقیاس بزرگ بیابید.

ترجمان کردن درک شما از الگوهای رایج آسیب‌پذیر در کد به ابزارهای خودکار، به شما کمک می‌کند در بخش بعدی کتاب — هنگام مهندسی معکوس باینری‌ها — بدانید چه چیزی را باید جستجو کنید. بازبینی کد مثل خواندن نقشه‌ها و نمودارهای یک ماشین پیچیده برای فهم آن است؛ مهندسی معکوس مثل این است که ماشینِ کاملاً ساخته‌شده را بدون نقشه و نمودار دریافت کنید و بر اساس مشاهده و تحلیل بفهمید چگونه کار می‌کند. بدون کمی دانش درباره اینکه چنین ماشین‌هایی معمولاً چگونه طراحی می‌شوند، کاملاً سرگردان خواهید بود. به همین ترتیب، آنچه از بازبینی کد آموختید، پایه‌ای محکم برای چند فصل بعدی خواهد بود.`,
};
